src/Reports/КонтрольИзмененнныхОбъектов/КонтрольИзмененнныхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КонтрольИзмененнныхОбъектов</name>
</mdclass:Report>

src/InformationRegisters/ЗадачиМетеорВерсийХранилища/ЗадачиМетеорВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорВерсийХранилища</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияЭтаповЗадачиМетеор/ИсторияЭтаповЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЭтаповЗадачиМетеор</name>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>стрИсполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <predefined>
    <items>
      <name>Финансы1С</name>
      <description>Финансы 1 С</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРазработки</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбновления</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяКонвейерОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьБазыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогическаяПодсистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.ЛогическиеПодсистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектGitEDT</name>
    <type>
      <types>CatalogRef.ПроектыGIT</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеВремяЗахватаПоУмолчаниюЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключаемыеАвторы</name>
    <attributes>
      <name>ИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШагиКонвейера</name>
    <attributes>
      <name>ДействиеКонвейераОбработки</name>
      <type>
        <types>CatalogRef.ДействияКонвейераОбработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТестовыеБазы</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияИсточник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаСоединенияПриемник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыЗапускаИнтеграционныхТестов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ИсторияХранилища/ИсторияХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсторияХранилища</name>
  <owners>Catalog.Хранилища</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Изменены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Добавлены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удалены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыGit</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйФайл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокДобавлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокУдалено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ЗадачиМетеор/ЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачиМетеор</name>
  <attributes>
    <name>id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>project_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>EnumRef.ВидыЗадачМетеор</types>
    </type>
  </attributes>
  <attributes>
    <name>Срочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>idv3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>project_idv3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.МеткиМетеор</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Reports/КонтрольИзмененнныхОбъектов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СведенияОВнешнейОбработке
// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
		
	Мета = ЭтотОбъект.Метаданные();
	Версия = Мета.Комментарий;
	ВерсияБСП = "3.1.7.82";
	ТекущаяВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия = Версия;
	ПараметрыРегистрации.Наименование = Мета.Представление();
	ПараметрыРегистрации.Информация = Мета.Представление();
	ПараметрыРегистрации.Назначение.Добавить("Подсистема.ПереносИзменений");
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "_" + Мета.Представление();
	НоваяКоманда.Идентификатор = Мета.ПолноеИмя();
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновки = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Конфигурация = Справочники.Конфигурации.ПустаяСсылка();
	ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиКомпоновки.Отбор, "Конфигурация");
	Если ЭлементыОтбора.Количество() 
			И ЭлементыОтбора[0].Использование 
			И ЭлементыОтбора[0].ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		Конфигурация = ЭлементыОтбора[0].ПравоеЗначение;
	КонецЕсли;
	
	ПараметрПериод = ОтчетыКлиентСервер.НайтиПараметр(НастройкиКомпоновки, Неопределено, "Период");
	НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
	КонецПериода = ПараметрПериод.Значение.ДатаОкончания;
	
	
	ИзмененияОбъетов = ИзмененияОбъетов(НачалоПериода, КонецПериода, Конфигурация);
	
	ВнешниеНаборыДанных = Новый Структура;
    ВнешниеНаборыДанных.Вставить("ИзмененияОбъетов", ИзмененияОбъетов);
	
	КомпановщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	МакетКомпановки = КомпановщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпановки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИзмененияОбъетов(НачалоПериода, КонецПериода, Конфигурация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияХранилища.Ссылка КАК ВерсияХО,
		|	ИсторияХранилища.Владелец.Владелец КАК Конфигурация,
		|	ИсторияХранилища.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ВерсииХО
		|ИЗ
		|	Справочник.ИсторияХранилища КАК ИсторияХранилища
		|ГДЕ
		|	ИсторияХранилища.Владелец В
		|			(ВЫБРАТЬ
		|				Конфигурации.ХранилищеОбновления КАК ХранилищеОбновления
		|			ИЗ
		|				Справочник.Конфигурации КАК Конфигурации)
		|	И ИсторияХранилища.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (&Конфигурация = ЗНАЧЕНИЕ(Справочник.Конфигурации.ПустаяСсылка)
		|			ИЛИ ИсторияХранилища.Владелец.Владелец = &Конфигурация)
		|{ГДЕ
		|	ИсторияХранилища.Владелец.Владелец.* КАК Конфигурация}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВерсииХО.ВерсияХО КАК ВерсияХО,
		|	ВерсииХО.Конфигурация КАК Конфигурация,
		|	ВерсииХО.Комментарий КАК Комментарий,
		|	СогласованиеПереносаКоммиты.Коммит КАК ВерсияХР,
		|	СогласованиеПереносаКоммиты.Коммит.Автор КАК АвторХР
		|ПОМЕСТИТЬ ВерсииХРПоПереносу
		|ИЗ
		|	ВерсииХО КАК ВерсииХО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.СогласованиеПереноса.Коммиты КАК СогласованиеПереносаКоммиты
		|		ПО ВерсииХО.ВерсияХО = СогласованиеПереносаКоммиты.КоммитХО
		|			И (НЕ СогласованиеПереносаКоммиты.Коммит = ЗНАЧЕНИЕ(Справочник.ИсторияХранилища.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВерсииХРПоПереносу.ВерсияХО КАК ВерсияХО,
		|	ВерсииХРПоПереносу.Конфигурация КАК Конфигурация,
		|	ВерсииХРПоПереносу.Комментарий КАК Комментарий,
		|	ВерсииХРПоПереносу.ВерсияХР КАК ВерсияХР,
		|	ЕСТЬNULL(Пользователи.Ссылка, ""Не найден"") КАК АвторВерсииХР,
		|	ЗадачиМетеорВерсийХранилища.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ВЫРАЗИТЬ(ЗадачиМетеорВерсийХранилища.ЗадачаМетеор.НаименованиеЗадачи КАК СТРОКА(1024)) КАК ЗадачаМетеорНаименование
		|ПОМЕСТИТЬ ВерсииХОиХР
		|ИЗ
		|	ВерсииХРПоПереносу КАК ВерсииХРПоПереносу
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВерсииХРПоПереносу.АвторХР = Пользователи.Код
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиМетеорВерсийХранилища КАК ЗадачиМетеорВерсийХранилища
		|		ПО ВерсииХРПоПереносу.ВерсияХР = ЗадачиМетеорВерсийХранилища.ВерсияХранилища
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВерсииХО.ВерсияХО,
		|	ВерсииХО.Конфигурация,
		|	ВерсииХО.Комментарий,
		|	ВерсииХО.ВерсияХО,
		|	""Не найден"",
		|	ЗНАЧЕНИЕ(Справочник.ЗадачиМетеор.ПустаяСсылка),
		|	""""
		|ИЗ
		|	ВерсииХО КАК ВерсииХО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВерсииХРПоПереносу КАК ВерсииХРПоПереносу
		|		ПО ВерсииХО.ВерсияХО = ВерсииХРПоПереносу.ВерсияХО
		|ГДЕ
		|	ВерсииХРПоПереносу.ВерсияХО ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВерсииХОиХР.ВерсияХО КАК ВерсияХО,
		|	ВерсииХОиХР.Конфигурация КАК Конфигурация,
		|	ВерсииХОиХР.Комментарий КАК Комментарий,
		|	ВерсииХОиХР.ВерсияХР КАК ВерсияХР,
		|	ВерсииХОиХР.АвторВерсииХР КАК АвторВерсииХР,
		|	ВерсииХОиХР.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ВерсииХОиХР.ЗадачаМетеорНаименование КАК ЗадачаМетеорНаименование,
		|	ИсторияХранилищаИзменены.ИмяОбъекта КАК ИмяОбъекта,
		|	""Изменены"" КАК ВидИзменения
		|ПОМЕСТИТЬ ВсеИзменения
		|ИЗ
		|	ВерсииХОиХР КАК ВерсииХОиХР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсторияХранилища.Изменены КАК ИсторияХранилищаИзменены
		|		ПО ВерсииХОиХР.ВерсияХР = ИсторияХранилищаИзменены.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВерсииХОиХР.ВерсияХО,
		|	ВерсииХОиХР.Конфигурация,
		|	ВерсииХОиХР.Комментарий,
		|	ВерсииХОиХР.ВерсияХР,
		|	ВерсииХОиХР.АвторВерсииХР,
		|	ВерсииХОиХР.ЗадачаМетеор,
		|	ВерсииХОиХР.ЗадачаМетеорНаименование,
		|	ИсторияХранилищаДобавлены.ИмяОбъекта,
		|	""Добавлены""
		|ИЗ
		|	ВерсииХОиХР КАК ВерсииХОиХР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсторияХранилища.Добавлены КАК ИсторияХранилищаДобавлены
		|		ПО ВерсииХОиХР.ВерсияХР = ИсторияХранилищаДобавлены.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВерсииХОиХР.ВерсияХО,
		|	ВерсииХОиХР.Конфигурация,
		|	ВерсииХОиХР.Комментарий,
		|	ВерсииХОиХР.ВерсияХР,
		|	ВерсииХОиХР.АвторВерсииХР,
		|	ВерсииХОиХР.ЗадачаМетеор,
		|	ВерсииХОиХР.ЗадачаМетеорНаименование,
		|	ИсторияХранилищаУдалены.ИмяОбъекта,
		|	""Удалены""
		|ИЗ
		|	ВерсииХОиХР КАК ВерсииХОиХР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсторияХранилища.Удалены КАК ИсторияХранилищаУдалены
		|		ПО ВерсииХОиХР.ВерсияХР = ИсторияХранилищаУдалены.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеИзменения.ВерсияХО КАК ВерсияХО,
		|	ВсеИзменения.Конфигурация КАК Конфигурация,
		|	ВсеИзменения.Комментарий КАК Комментарий,
		|	ВсеИзменения.АвторВерсииХР КАК АвторВерсииХР,
		|	ВсеИзменения.ЗадачаМетеор КАК ЗадачаМетеор,
		|	ВсеИзменения.ЗадачаМетеорНаименование КАК ЗадачаМетеорНаименование,
		|	ВсеИзменения.ИмяОбъекта КАК ИмяОбъекта,
		|	ВсеИзменения.ВидИзменения КАК ВидИзменения,
		|	ИсторияЭтаповЗадачиМетеор.стрИсполнитель КАК Аналитик
		|ИЗ
		|	ВсеИзменения КАК ВсеИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияЭтаповЗадачиМетеор КАК ИсторияЭтаповЗадачиМетеор
		|		ПО ВсеИзменения.ЗадачаМетеор = ИсторияЭтаповЗадачиМетеор.ЗадачаМетеор
		|			И (ИсторияЭтаповЗадачиМетеор.Этап = &ЭтапАналитическаяПроработка)";
	
	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ЭтапАналитическаяПроработка", Справочники.ЭтапыЗадачиМетеор.АналитическаяПроработка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	ДанныеЗадач = Неопределено;
	Попытка
		ДанныеЗадач = ИнтеграцияСМетеор.ПолучитьДанныеЗадачМетеор(Результат.ВыгрузитьКолонку("ЗадачаМетеор"));
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	Если ДанныеЗадач = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	Для Каждого СтрокаРезультата Из Результат Цикл
		АдминистраторЗадачи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеЗадач.Получить(СтрокаРезультата.ЗадачаМетеор), "admin");
		СтрокаРезультата.Аналитик = ?(АдминистраторЗадачи = Неопределено, СтрокаРезультата.Аналитик, АдминистраторЗадачи);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
